app/views/books/show.html.erb

		　　　	<!-- コメント数表示 -->
		　　　	     <td>コメント数<%= @book.book_comments.count %></td>
---
SELECT "books".* FROM "books"