app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "dddd"], ["profile_image_id", "83115786879232baf4beecfc40db8beff365a335b7a060b63ff5bf9eabc8"], ["updated_at", "2021-05-02 05:03:15.210819"], ["id", 1]]

  def ensure_correct_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]